In [4]:
import numpy as np 
import pandas as pd

In [5]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [7]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [8]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [10]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [11]:
# converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

Working with Date

In [12]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [ ]:
# Extracting year, month, day, weekday
date['year'] = date['date'].dt.year
date['month'] = date['date'].dt.month
date['month_name'] = date['date'].dt.month_name()
date['day'] = date['date'].dt.day
date['weekday'] = date['date'].dt.dayofweek
date['weekday_name'] = date['date'].dt.day_name()


date.sample(7)

,date,product_id,city_id,orders,year,month,month_name,day,weekday,weekday_name
720,2019-04-01,6212,7,3,2019,4,April,1,0,Monday
430,2019-10-20,6336,23,13,2019,10,October,20,6,Sunday
700,2019-10-23,2669,25,20,2019,10,October,23,2,Wednesday
11,2019-08-02,3311,22,6,2019,8,August,2,4,Friday
128,2019-11-23,6204,24,2,2019,11,November,23,5,Saturday
364,2019-03-26,5687,13,11,2019,3,March,26,1,Tuesday
280,2018-08-18,6716,16,2,2018,8,August,18,5,Saturday

In [21]:
# is weekend? 
date['weekend'] = np.where(date['weekday_name'].isin(['Sunday','Saturday']), True,False)

date.sample(7)

,date,product_id,city_id,orders,year,month,month_name,day,weekday,weekday_name,weekend
895,2018-10-31,2714,28,8,2018,10,October,31,2,Wednesday,False
775,2019-05-27,5968,13,11,2019,5,May,27,0,Monday,False
594,2019-04-14,547,4,86,2019,4,April,14,6,Sunday,True
773,2019-11-23,1479,16,3,2019,11,November,23,5,Saturday,True
739,2019-08-06,1673,13,2,2019,8,August,6,1,Tuesday,False
262,2018-11-14,4667,9,1,2018,11,November,14,2,Wednesday,False
593,2018-11-17,2973,26,7,2018,11,November,17,5,Saturday,True

In [29]:
# Extracting week of the y
date = date.drop(columns=['date_week'])

date.sample(7)

,date,product_id,city_id,orders,year,month,month_name,day,weekday,weekday_name,weekend
88,2019-10-11,925,25,10,2019,10,October,11,4,Friday,False
158,2019-12-16,2148,28,51,2019,12,December,16,0,Monday,False
17,2018-09-24,2701,14,16,2018,9,September,24,0,Monday,False
537,2019-06-29,2563,18,14,2019,6,June,29,5,Saturday,True
989,2019-02-20,438,22,28,2019,2,February,20,2,Wednesday,False
547,2019-06-21,793,29,3,2019,6,June,21,4,Friday,False
375,2019-07-14,2002,1,3,2019,7,July,14,6,Sunday,True

In [32]:
# Extracting quatrer
date['quarter']= date['date'].dt.quarter


date.sample(7)

,date,product_id,city_id,orders,year,month,month_name,day,weekday,weekday_name,weekend,quater,quarter
928,2019-01-02,5371,22,4,2019,1,January,2,2,Wednesday,False,1,1
419,2018-08-22,7430,1,1,2018,8,August,22,2,Wednesday,False,3,3
17,2018-09-24,2701,14,16,2018,9,September,24,0,Monday,False,3,3
853,2019-08-11,7430,1,1,2019,8,August,11,6,Sunday,True,3,3
108,2019-10-24,7538,0,1,2019,10,October,24,3,Thursday,False,4,4
33,2019-07-11,3121,17,1,2019,7,July,11,3,Thursday,False,3,3
178,2019-04-30,4776,16,100,2019,4,April,30,1,Tuesday,False,2,2

In [34]:
# extracting Semester
date['semester'] = np.where(date['quarter'].isin([1,2]), 1,2)


date.sample(7)

,date,product_id,city_id,orders,year,month,month_name,day,weekday,weekday_name,weekend,quater,quarter,semester
140,2018-10-31,5112,10,1,2018,10,October,31,2,Wednesday,False,4,4,2
605,2018-11-19,5452,26,12,2018,11,November,19,0,Monday,False,4,4,2
80,2018-12-05,1754,23,2,2018,12,December,5,2,Wednesday,False,4,4,2
521,2018-08-23,5482,25,7,2018,8,August,23,3,Thursday,False,3,3,2
849,2019-10-10,2232,18,23,2019,10,October,10,3,Thursday,False,4,4,2
920,2019-01-26,6315,22,1,2019,1,January,26,5,Saturday,True,1,1,1
715,2018-07-26,1667,25,9,2018,7,July,26,3,Thursday,False,3,3,2

In [35]:
# Extract Time elapsed between dates

import datetime 

today = datetime.datetime.today()

today

datetime.datetime(2025, 12, 17, 9, 45, 56, 316525)

In [40]:
(today - date['date']).dt.days

0      2199
1      2681
2      2612
3      2314
4      2537
       ...
995    2627
996    2568
997    2416
998    2481
999    2255
Name: date, Length: 1000, dtype: int64

In [47]:
# Months Passed
np.round((today - date['date']) / np.timedelta64(1, 'D'),0)

0      2199.0
1      2681.0
2      2612.0
3      2314.0
4      2537.0
        ...
995    2627.0
996    2568.0
997    2416.0
998    2481.0
999    2255.0
Name: date, Length: 1000, dtype: float64

In [48]:
# TIME

In [49]:
# converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [52]:
# Extracting onlytime ,Hours, Minutes, Seconds
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second
time['time'] = time['date'].dt.time
time.sample(8)

,date,msg,hour,min,sec,time
126,2014-11-02 01:19:00,ПОЗНАКОМЛЮСЬ С ДЕВУШКОЙ . СЕЖУ В ТЮРЬМЕ. 068-4...,1,19,0,01:19:00
974,2013-02-06 00:40:00,парень 25 познакомиться с девушкой с днепра см...,0,40,0,00:40:00
599,2013-02-26 23:50:00,Янка привет тебе по Жовтневке думаю ты скоро б...,23,50,0,23:50:00
455,2014-01-02 23:21:00,Если мне не позвонят я засну! разбудите пожалу...,23,21,0,23:21:00
877,2013-12-30 23:54:00,Девушка ищет девушку.0639908904,23,54,0,23:54:00
185,2014-05-16 00:44:00,ищу смелых парней готовых на необдуманные пост...,0,44,0,00:44:00
746,2013-10-18 01:34:00,щедр красив умен и богат на своем авто! Нуж...,1,34,0,01:34:00
668,2013-01-02 23:40:00,дев обмен ммс с дев 0935218838,23,40,0,23:40:00

In [68]:
today = datetime.datetime.today()

today - time['date']

0     4385 days 09:07:25.840619
1     4249 days 10:17:25.840619
2     4735 days 09:36:25.840619
3     4037 days 09:26:25.840619
4     4434 days 10:46:25.840619
                 ...
995   5024 days 09:07:25.840619
996   4345 days 10:43:25.840619
997   4810 days 10:20:25.840619
998   4926 days 10:23:25.840619
999   4198 days 10:32:25.840619
Name: date, Length: 1000, dtype: timedelta64[ns]